app/controllers/feeds_controller.rb

SELECT "feeds".* FROM "feeds"
---
  def index
    @feeds = Feed.all

INSERT INTO "feeds" ("title", "url", "created_at", "updated_at") VALUES ('DeviantArt (FierceTheBandit)', 'https://backend.deviantart.com/rss.xml?q=gallery:fiercethebandit', '2025-03-25 10:00:04.866244', '2025-03-25 10:00:04.866244') RETURNING "id"
---
  def create
    @feed = Feed.new(feed_params)
    if @feed.save

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = 1 LIMIT 1
---
  def show
    @feed = Feed.find_by(id: params[:id])

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = 1 LIMIT 1
DELETE FROM "feeds" WHERE "feeds"."id" = 1
---
  def destroy
    @feed = Feed.find(params[:id])
    @feed.destroy